# ========================================================================================================
# Домашнее задание:
# Дополнить справочник возможностью копирования данных из одного файла в другой. 
# Пользователь вводит номер строки, которую необходимо перенести из одного файла в другой.
# Формат сдачи: ссылка на свой репозиторий.
# ========================================================================================================


# =================================================================================================================
# ========================Альтернативный Вариант c заменой строки==================================================
# =================================================================================================================

# Представлены 2 файла - телефонные справочники('Moscow.txt', 'Урюпинск.txt'). Первая строка - это шапка таблицы, 
# поэтому игнорируется. Порядковые номера строк условно начинается со 2 строки файла.


file_names = ['Moscow.txt', 'Урюпинск.txt']
file_from = file_names[0]   # файл, из которого копируется строка
file_to = file_names[1]     # файл, куда копируется строка

#Запрос номер строки, которую необходимо перенести в другой файл
input_num = int(input("Напишите, пожалуйста, какой контакт по счету надо перенести из справочника " + file_from + " в " + file_to + " :"))

From_file = open( file_from, 'r')
line_count = sum(1 for line in From_file)-1  #смещение на одну строку ниже, т.к. 1-ая - это шапка таблицы 

if line_count>=input_num:
    with open( file_from, 'r') as data_from:
        for lno, line in enumerate(data_from):
            if lno == input_num:
                line_name = line
                with open( file_to, 'r+') as data_to:
                    lines = data_to.readlines()
                    lines[lno] = line_name
                    data_to.seek(0)

    
    with open( file_to, 'w+') as data_to:
        for line in lines:
            data_to.write(line)
        
else:
    print("В справочнике меньшее количество контактов (не более " + str(line_count) + ")!")